/* Copyright (C) 2012 BJöRFUAN
 * This source and related resources are distributed under Apache License, Version 2.0.
 */
package com.kazzla.domain

import java.net.{URI, SocketAddress}

// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// RegistryServer
// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
/**
 * <p>
 * プロトコルは Code によって符号化された転送単位 (Transfer Unit) と実際の転送ストリー
 * ム上での入出力をマッピングするレイヤーです。
 * インスタンスはパイプラインの接続に対してスコープを持ちます。
 * </p>
 * @author Takami Torao
 */
trait RegistryService {

	// ========================================================================
	// サービスの検索
	// ========================================================================
	/**
	 * 指定された名前のサービスを提供しているソケットアドレスを参照します。
	 */
	def lookupService(name:String):Iterable[URI]

	// ========================================================================
	// ========================================================================
	/**
	 * 指定された転送単位を転送します。
	 * 指定されたデータブロックを転送します。
	 */
	def lookupNode()

	// ========================================================================
	// ========================================================================
	/**
	 * 指定された転送単位を転送します。
	 * 指定されたデータブロックを転送します。
	 */
	def registerNode()

}
