/*
 * Copyright (c) 2013 koiroha.org.
 * All sources and related resources are available under Apache License 2.0.
 * http://www.apache.org/licenses/LICENSE-2.0.html
*/
package com.kazzla.node

import com.kazzla.asterisk.Export
import java.util.UUID
import scala.concurrent.Future

// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// Volume
// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
/**
 * @author Takami Torao
 */
trait Storage {

	// ==============================================================================================
	// UUID の参照
	// ==============================================================================================
	/**
	 * このストレージが管理しているブロックの全 UUID をパイプストリームに送出します。
	 */
	@Export(10)
	def ping():Future[Unit]

	// ==============================================================================================
	// UUID の参照
	// ==============================================================================================
	/**
	 * このストレージが管理しているブロックの全 UUID をパイプストリームに送出します。
	 */
	@Export(100)
	def lookup():Future[Unit]

	// ==============================================================================================
	// チェックサムの参照
	// ==============================================================================================
	/**
	 * 指定されたブロックのチェックサムを算出します。ストレージが正しいデータを保持していることを保証するために任意値
	 * をとるチャレンジバイトをサーバ側から指定します。
	 *
	 * @param blockId ブロック ID
	 * @param algorithm ハッシュアルゴリズム (MD5, SHA-512)
	 * @param challenge ブロックの先頭に付けられるチャレンジデータ
	 */
	@Export(110)
	def checksum(blockId:UUID, algorithm:String, challenge:Array[Byte]):Future[Array[Byte]]

	// ==============================================================================================
	// ブロックの作成
	// ==============================================================================================
	/**
	 * 指定されたブロックを作成します。
	 *
	 * @param blockId ブロック ID
	 * @param size ブロックサイズ
	 */
	@Export(200)
	def create(blockId:UUID, size:Long):Future[Unit]

	// ==============================================================================================
	// ブロックの読み込み
	// ==============================================================================================
	/**
	 * 指定されたブロックの領域を読み込みます。
	 *
	 * @param blockId ブロック ID
	 */
	@Export(210)
	def read(blockId:UUID, offset:Long, length:Int):Future[Unit]

	// ==============================================================================================
	// ブロックの書き込み
	// ==============================================================================================
	/**
	 * 指定されたブロックの領域を書き込みます。
	 *
	 * @param blockId ブロック ID
	 */
	@Export(220)
	def update(blockId:UUID, offset:Long, length:Int):Future[Unit]

	// ==============================================================================================
	// ブロックの削除
	// ==============================================================================================
	/**
	 * 指定されたブロックを削除します。
	 *
	 * @param blockId ブロック ID
	 */
	@Export(230)
	def delete(blockId:UUID):Future[Unit]

}
