/*
 * Copyright (c) 2013 koiroha.org.
 * All sources and related resources are available under Apache License 2.0.
 * http://www.apache.org/licenses/LICENSE-2.0.html
*/
package com.kazzla.storage

import com.kazzla.asterisk.Export
import java.util.UUID
import scala.concurrent.Future

// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// RegionNode
// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
/**
 * @author Takami Torao
 */
trait RegionNode {

	// ==============================================================================================
	// 時刻同期
	// ==============================================================================================
	/**
	 * ノードとサービス間で時刻同期を行います。この機能はサービス側からの死活監視として呼び出されます。
	 * @param tm サービス側の現在時刻
	 * @return ノード側の現在時刻
	 */
	@Export(10)
	def sync(tm:Long):Future[Long]

	// ==============================================================================================
	// UUID の参照
	// ==============================================================================================
	/**
	 * このストレージが管理しているブロックの全 UUID をパイプストリームに送出します。
	 */
	@Export(100)
	def lookup():Future[Unit]

	// ==============================================================================================
	// チェックサムの参照
	// ==============================================================================================
	/**
	 * 指定されたブロックのチェックサムを算出します。ストレージが正しいデータを保持していることを保証するために任意値
	 * をとるチャレンジバイトをサーバ側から指定します。
	 *
	 * @param blockId ブロック ID
	 * @param algorithm ハッシュアルゴリズム (MD5, SHA-512)
	 * @param challenge ブロックの先頭に付けられるチャレンジデータ
	 */
	@Export(110)
	def checksum(blockId:UUID, algorithm:String, challenge:Array[Byte]):Future[Array[Byte]]

	// ==============================================================================================
	// ブロックの作成
	// ==============================================================================================
	/**
	 * 指定されたブロックを作成します。
	 *
	 * @param blockId ブロック ID
	 * @param size ブロックサイズ
	 */
	@Export(200)
	def create(blockId:UUID, size:Long):Future[Unit]

	// ==============================================================================================
	// ブロックの削除
	// ==============================================================================================
	/**
	 * 指定されたブロックを削除します。
	 *
	 * @param blockId ブロック ID
	 */
	@Export(230)
	def delete(blockId:UUID):Future[Unit]

}
