/* Copyright (C) 2012 BJöRFUAN
 * This source and related resources are distributed under Apache License, Version 2.0.
 */
package com.kazzla.drpc

import async.RawBuffer

// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// Codec
// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
/**
 * プロシジャコールを入出力用にバイナリ化するためのトレイトです。
 * インスタンスは 1 接続に対するスコープを持つため内部でバッファリングを行うことができます。
 * @author Takami Torao
 */
trait Codec {

	// ========================================================================
	// バッファの作成
	// ========================================================================
	/**
	 * RPC のための呼び出し要求用バイナリを作成します。
	 */
	def pack(call:Codec.Call):Array[Byte]

	// ========================================================================
	// バッファの作成
	// ========================================================================
	/**
	 * RPC 呼び出し結果用のバイナリを作成します。
	 */
	def pack(result:Codec.Result):Array[Byte]

	// ========================================================================
	// バッファの復元
	// ========================================================================
	/**
	 * 指定されたバッファから転送オブジェクトを復元します。
	 */
	def unpack(buffer:RawBuffer):Seq[Codec.Transferable]

}

object Codec {
	import com.kazzla.debug.makeDebugString

	// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	// Transferable
	// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	/**
	 * @author Takami Torao
	 */
	class Transferable private[Codec]

	// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	// Call
	// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	/**
	 * @author Takami Torao
	 */
	case class Call(id:Long, timeout:Long, name:String, args:Any*) extends Transferable {

		// ======================================================================
		// インスタンスの文字列化
		// ======================================================================
		/**
		 * このインスタンスを文字列化します。
		 * @return インスタンスの文字列
		 */
		override def toString():String = {
			id + "@" + name + '(' + makeDebugString(args) + ')'
		}

	}

	// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	// Result
	// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	/**
	 * @author Takami Torao
	 */
	case class Result(id:Long, error:Option[String], result:Any*) extends Transferable {

		// ======================================================================
		// インスタンスの文字列化
		// ======================================================================
		/**
		 * このインスタンスを文字列化します。
		 * @return インスタンスの文字列
		 */
		override def toString():String = {
			id + "@" + (error match {
				case Some(msg) => "Exception(" + makeDebugString(msg) + ")"
				case None => makeDebugString(result)
			})
		}

	}

}