/* Copyright (C) 2012 BJöRFUAN
 * This source and related resources are distributed under Apache License, Version 2.0.
 */
package com.kazzla.drpc

import async.RawBuffer

// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// Codec
// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
/**
 * プロシジャコールを入出力用にバイナリ化するためのトレイトです。
 * インスタンスは 1 接続に対するスコープを持つため内部でバッファリングを行うことができます。
 * @author Takami Torao
 */
trait Codec {

	// ========================================================================
	// バッファの作成
	// ========================================================================
	/**
	 * RPC のための呼び出し要求用バイナリを作成します。
	 * 引数は Call, Result, Control のいずれかの型を持ちます。
	 */
	def pack(unit:Transferable):Array[Byte]

	// ========================================================================
	// バッファの復元
	// ========================================================================
	/**
	 * 指定されたバッファから転送オブジェクトを復元します。
	 */
	def unpack(buffer:RawBuffer):Option[Transferable]

}
