/* Copyright (C) 2012 BJöRFUAN
 * This source and related resources are distributed under Apache License, Version 2.0.
 */
package com.kazzla.drpc

import java.nio.ByteBuffer

// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// Protocol
// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
/**
 * <p>
 * プロトコルは Code によって符号化された転送単位 (Transfer Unit) と実際の転送ストリー
 * ム上での入出力をマッピングするレイヤーです。
 * インスタンスはパイプラインの接続に対してスコープを持ちます。
 * </p>
 * @author Takami Torao
 */
trait Protocol {

	// ========================================================================
	// データの転送
	// ========================================================================
	/**
	 * 指定された転送単位を転送します。
	 * 指定されたデータブロックを転送します。
	 * @param buffer 転送するデータ
	 */
	def transferUnit(buffer:ByteBuffer):ByteBuffer

	// ========================================================================
	// データの転送
	// ========================================================================
	/**
	 * 指定された転送単位を転送します。
	 * 指定されたデータブロックを転送します。
	 * @param buffer 転送するデータ
	 */
	def transferUnit2(buffer:ByteBuffer):ByteBuffer

}
