/* Copyright (C) 2012 BJöRFUAN
 * This source and related resources are distributed under Apache License, Version 2.0.
 */
package com.kazzla.domain.irpc

import java.nio.channels.Selector

// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// ServiceContext
// +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
/**
 * @author Takami Torao
 */
class ServiceContext() {

	// ========================================================================
	// コーデック
	// ========================================================================
	/**
	 * この
	 */
	private[this] var codec

	// ========================================================================
	// リモート処理中パイプ
	// ========================================================================
	/**
	 * リモート処理中のパイプです。
	 */
	private[this] var remoteProcessing = List[Pipe]()

	// ========================================================================
	// セレクター
	// ========================================================================
	/**
	 * このインスタンスが使用するセレクターです。
	 */
	def open():Unit = {

	}

}
